Revit 2027 API
FabricHostReference Enumeration
 Controls if Single Fabric Sheet should be cut by the Host Cover.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum FabricHostReference
Public Enumeration FabricHostReference
public enum class FabricHostReference
type FabricHostReference
Members
Member name | Value | Description
CutByCover | 1 |  The fabric is cut by the host cover.
NotCutByCover | 0 |  The fabric is not cut by the host cover.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace